NAMA : REZA PUTRI ANGGA
NPM : 22083010006
MATA KULIAH : DATA WRANGLING (D)

# PYTHON DAN SQL

1. Buat Database Yang Telah Di Tentukan Menggunakan Perintah Pada Python

In [1]:
import sqlite3

con = sqlite3.connect("tour_agency.db", timeout = 10)
print("Database dengan nama tour_agency.db berhasil di buat")

con.close()

Database dengan nama tour_agency.db berhasil di buat

2. Buat Minimal 2 Tabel Dan Tambahkan Data Menggunakan Perintah Pada Python

2.A.1 Tabel Pertama (TourPackage)

In [2]:
import sqlite3

con = sqlite3.connect("tour_agency.db", timeout = 10)
cur = con.cursor()

for row in cur.execute("CREATE TABLE TourPackage (PackageID int, GuideID int, CustomerID int, PackageName varchar(20), \
                        PackageDuration int, PackageType varchar(20))"):
    print(row)
con.commit()

print("Tabel TourPackage berhasil di buat")

con.close()

Tabel TourPackage berhasil di buat

2.A.2 Menambahkan Data Pada Tabel TourPackage

In [3]:
import sqlite3

con = sqlite3.connect("tour_agency.db", timeout = 10)
cur = con.cursor()

for row in cur.execute("INSERT INTO TourPackage VALUES (1, 1, 1, 'Tour Indp', 2, 'Short Trip')"):
    print(row)
for row in cur.execute("INSERT INTO TourPackage VALUES (2, 2, 2, 'Tour Group', 5, 'Long Trip')"):
    print(row)
con.commit()

print("2 data pada tabel TourPackage berhasil di tambahkan")

con.close()

2 data pada tabel TourPackage berhasil di tambahkan

2.A.3 Menampilkan Data Pada Tabel TourPackage

In [4]:
import sqlite3

print("Di tampilkan 2 data pada tabel TourPackage : ")

con = sqlite3.connect("tour_agency.db", timeout = 10)
cur = con.cursor()

for row in cur.execute("SELECT * FROM TourPackage"):
    print(row)
con.commit()

con.close()

Di tampilkan 2 data pada tabel TourPackage :
(1, 1, 1, 'Tour Indp', 2, 'Short Trip')
(2, 2, 2, 'Tour Group', 5, 'Long Trip')

2.B.1 Tabel Kedua (TourGuide)

In [5]:
import sqlite3

con = sqlite3.connect("tour_agency.db", timeout = 10)
cur = con.cursor()

for row in cur.execute("CREATE TABLE TourGuide (GuideID int, GuideName varchar(20), GuidePhoneNumber int, \
                        GuideYearsService int)"):
    print(row)
con.commit()

print("Tabel TourGuide berhasil di buat")

con.close()

Tabel TourGuide berhasil di buat

2.B.2 Menambahkan Data Pada Tabel TourGuide

In [6]:
import sqlite3

con = sqlite3.connect("tour_agency.db", timeout = 10)
cur = con.cursor()

for row in cur.execute("INSERT INTO TourGuide VALUES (1, 'Arinto Ly', 6281335678991, 3)"):
    print(row)
for row in cur.execute("INSERT INTO TourGuide VALUES (2, 'Nadhela Jasmine', 6289221456151, 5)"):
    print(row)
for row in cur.execute("INSERT INTO TourGuide VALUES (3, 'Apriola Lyla', 6289112345671, 2)"):
    print(row)
con.commit()

print("3 data pada tabel TourGuide berhasil di tambahkan")

con.close()

3 data pada tabel TourGuide berhasil di tambahkan

2.B.3 Menampilkan Data Pada Tabel TourGuide

In [7]:
import sqlite3

print("Di tampilkan 3 data pada tabel TourGuide : ")

con = sqlite3.connect("tour_agency.db", timeout = 10)
cur = con.cursor()

for row in cur.execute("SELECT * FROM TourGuide"):
    print(row)
con.commit()

con.close()

Di tampilkan 3 data pada tabel TourGuide :
(1, 'Arinto Ly', 6281335678991, 3)
(2, 'Nadhela Jasmine', 6289221456151, 5)
(3, 'Apriola Lyla', 6289112345671, 2)

2.C.1 Tabel Ketiga (TourCustomer)

In [10]:
import sqlite3

con = sqlite3.connect("tour_agency.db", timeout = 10)
cur = con.cursor()

for row in cur.execute("CREATE TABLE TourCustomer (CustomerID int, CustomerName varchar(20), CustomerPhoneNumber int, \
                        CustomerPayment varchar(20))"):
    print(row)
con.commit()

print("Tabel TourCustomer berhasil di buat")

con.close()

Tabel TourCustomer berhasil di buat

2.C.2 Menambahkan Data Pada Tabel TourCustomers

In [11]:
import sqlite3

con = sqlite3.connect("tour_agency.db", timeout = 10)
cur = con.cursor()

for row in cur.execute("INSERT INTO TourCustomer VALUES (1, 'Andieni Afa', 6281445728291, 'Cashless')"):
    print(row)
for row in cur.execute("INSERT INTO TourCustomer VALUES (2, 'Rafael Ziva', 6281992818182, 'Cash')"):
    print(row)
for row in cur.execute("INSERT INTO TourCustomer VALUES (3, 'Nyndra Lyla', 6281998241618, 'Cash')"):
    print(row)
for row in cur.execute("INSERT INTO TourCustomer VALUES (4, 'Nadya Wulan', 628898919181, 'Cash')"):
    print(row)
con.commit()

print("4 data pada tabel TourCustomer berhasil di tambahkan")

con.close()

4 data pada tabel TourCustomer berhasil di tambahkan

2.C.3 Menampilkan Data Pada Tabel TourCustomer

In [13]:
import sqlite3

print("Di tampilkan 4 data pada tabel TourCustomer : ")

con = sqlite3.connect("tour_agency.db", timeout = 10)
cur = con.cursor()

for row in cur.execute("SELECT * FROM TourCustomer"):
    print(row)
con.commit()

con.close()

Di tampilkan 4 data pada tabel TourCustomer :
(1, 'Andieni Afa', 6281445728291, 'Cashless')
(2, 'Rafael Ziva', 6281992818182, 'Cash')
(3, 'Nyndra Lyla', 6281998241618, 'Cash')
(4, 'Nadya Wulan', 628898919181, 'Cash')

3. Lakukan Pemutakhiran Data Pada Tabel Yang Telah Di Buat Menggunakan Perintah Pada Python

3.A Membuat Kolom Baru Pada Tabel TourPackage Untuk Pemutakhiran Data

In [15]:
import sqlite3

con = sqlite3.connect("tour_agency.db", timeout = 10)
cur = con.cursor()

for row in cur.execute("ALTER TABLE TourPackage ADD COLUMN PackageDestination varchar(50)"):
    print(row)
for row in cur.execute("ALTER TABLE TourPackage ADD COLUMN PackagePrice int"):
    print(row)
con.commit()

print("Kolom PackageDestination dan PackagePrice pada tabel TourPackage berhasil di buat")

con.close()

Kolom PackageDestination dan PackagePrice pada tabel TourPackage berhasil di buat

3.B Melakukan Pemutakhiran Data (Update) Dengan Menambahkan Values Pada Kolom Yang Baru

In [18]:
import sqlite3

con = sqlite3.connect("tour_agency.db", timeout = 10)
cur = con.cursor()

for row in cur.execute("UPDATE TourPackage SET PackageDestination = 'Pantai Ngliyep, Obelix Hills, Bukit Bintang', PackagePrice = 350000 WHERE PackageName = 'Tour Indp'"):
    print(row)
for row in cur.execute("UPDATE TourPackage SET PackageDestination = 'Pantai Sluban, Wake Park, Nusa Peninda', PackagePrice = 550000 WHERE PackageName = 'Tour Group'"):
    print(row)
con.commit()

print("Pemutakhiran Data (Update) dengan penambahan values pada kolom baru berhasil di tambhkan")

con.close()

Pemutakhiran Data (Update) dengan penambahan values pada kolom baru berhasil di tambhkan

3.C Menampilkan Data Dari Hasil Pemutakhiran Data

In [19]:
import sqlite3

print("Di tampilkan data dari hasil pemutakhiran data : ")

con = sqlite3.connect("tour_agency.db", timeout = 10)
cur = con.cursor()

for row in cur.execute("SELECT * FROM TourPackage"):
    print(row)
con.commit()

con.close()

Di tampilkan data dari hasil pemutakhiran data :
(1, 1, 1, 'Tour Indp', 2, 'Short Trip', 'Pantai Ngliyep, Obelix Hills, Bukit Bintang', 350000)
(2, 2, 2, 'Tour Group', 5, 'Long Trip', 'Pantai Sluban, Wake Park, Nusa Peninda', 550000)

4. Lakukan Pengelompokkan Data Pada Tabel Yang Telah Di Buat Menggunakan Perintah Pada Python

4.A Menambahkan 2 Data Pada Tabel TourPackage

In [21]:
import sqlite3

con = sqlite3.connect("tour_agency.db", timeout = 10)
cur = con.cursor()

for row in cur.execute("INSERT INTO TourPackage VALUES (3, 3, 3, 'Tour Flash', 1, 'Short Trip', 'Malang Night Paraside, Coban Rais', 15000)"):
    print(row)
for row in cur.execute("INSERT INTO TourPackage VALUES (4, 3, 4, 'Tour Earlier', 3, 'Short Trip', 'Legend Star Park, Museum Musik Dunia', 20000)"):
    print(row)
con.commit()

print("2 data pada tabel TourPackage berhasil di tambahkan")

con.close()

2 data pada tabel TourPackage berhasil di tambahkan

4.B. Menampilkan Semua Data Pada Tabel TourPackage

In [23]:
import sqlite3

print("Di tampilkan semua data pada tabel TourPackage : ")

con = sqlite3.connect("tour_agency.db", timeout = 10)
cur = con.cursor()

for row in cur.execute("SELECT * FROM TourPackage"):
    print(row)
con.commit()

con.close()

Di tampilkan semua data pada tabel TourPackage :
(1, 1, 1, 'Tour Indp', 2, 'Short Trip', 'Pantai Ngliyep, Obelix Hills, Bukit Bintang', 350000)
(2, 2, 2, 'Tour Group', 5, 'Long Trip', 'Pantai Sluban, Wake Park, Nusa Peninda', 550000)
(3, 3, 3, 'Tour Flash', 1, 'Short Trip', 'Malang Night Paraside, Coban Rais', 15000)
(4, 3, 4, 'Tour Earlier', 3, 'Short Trip', 'Legend Star Park, Museum Musik Dunia', 20000)

4.C Mengelompokkan Data Berdasarkan PackageType

In [25]:
import sqlite3

print("Di tampilkan hasil pengelompokkan data berdasarkan PackageType : ")

con = sqlite3.connect("tour_agency.db", timeout = 10)
cur = con.cursor()

for row in cur.execute("SELECT COUNT(*), PackageType FROM TourPackage Group BY PackageType"):
    print(row)
con.commit()

con.close()

Di tampilkan hasil pengelompokkan data berdasarkan PackageType :
(1, 'Long Trip')
(3, 'Short Trip')

5. Lakukan Join Data Pada Tabel Yang Telah Di Buat Menggunakan Perintah Pada Python

5.A Menampilkan Data Berdasarkan PackageID Dengan Menerapkan Query Join

In [32]:
import sqlite3

print("Di tampilkan hasil joining berdasarkan PackageID : ")

con = sqlite3.connect("tour_agency.db", timeout=10)
cur = con.cursor()

for row in cur.execute("SELECT pkg.PackageID, pkg.PackageName, pkg.PackageType, g.GuideName, c.CustomerName FROM TourPackage \
                        pkg INNER JOIN TourGuide g ON g.GuideID = pkg.GuideID INNER JOIN TourCustomer c ON c.CustomerID = \
                        pkg.CustomerID WHERE pkg.PackageID"):
    print(row)

con.commit()

con.close()

Di tampilkan hasil joining berdasarkan PackageID :
(1, 'Tour Indp', 'Short Trip', 'Arinto Ly', 'Andieni Afa')
(2, 'Tour Group', 'Long Trip', 'Nadhela Jasmine', 'Rafael Ziva')
(3, 'Tour Flash', 'Short Trip', 'Apriola Lyla', 'Nyndra Lyla')
(4, 'Tour Earlier', 'Short Trip', 'Apriola Lyla', 'Nadya Wulan')

5.B Menampilkan Data Berdasarkan PackageID Dengan Menerapkan Query Join (Dengan Tambahan Teks)

In [35]:
import sqlite3

con = sqlite3.connect("tour_agency.db", timeout=10)
cur = con.cursor()

results = cur.execute("SELECT pkg.PackageID, pkg.PackageName, pkg.PackageType, g.GuideName, c.CustomerName FROM TourPackage \
                        pkg INNER JOIN TourGuide g ON g.GuideID = pkg.GuideID INNER JOIN TourCustomer c ON c.CustomerID = \
                        pkg.CustomerID WHERE pkg.PackageID")

for result in results:
    PackageID = result[0]
    PackageName = result[1]
    PackageType = result[2]
    GuideName = result[3]
    CustomerName = result[4]
    print("Tour dengan Package ID " + str(PackageID) + " dengan nama Package " + PackageName + " dan jenis Package " + \
          PackageType + " di pandu oleh Guide bernama " + GuideName + "  dan di ikuti oleh Customer bernama " + CustomerName)

con.commit()

con.close()

Tour dengan Package ID 1 dengan nama Package Tour Indp dan jenis Package Short Trip di pandu oleh Guide bernama Arinto Ly  dan di ikuti oleh Customer bernama Andieni Afa
Tour dengan Package ID 2 dengan nama Package Tour Group dan jenis Package Long Trip di pandu oleh Guide bernama Nadhela Jasmine  dan di ikuti oleh Customer bernama Rafael Ziva
Tour dengan Package ID 3 dengan nama Package Tour Flash dan jenis Package Short Trip di pandu oleh Guide bernama Apriola Lyla  dan di ikuti oleh Customer bernama Nyndra Lyla
Tour dengan Package ID 4 dengan nama Package Tour Earlier dan jenis Package Short Trip di pandu oleh Guide bernama Apriola Lyla  dan di ikuti oleh Customer bernama Nadya Wulan